import fetch from 'node-fetch';

// Para configurar o idioma, na raiz do projeto altere o arquivo config.json
// Para configurar el idioma, en la raíz del proyecto, modifique el archivo config.json.
// To set the language, in the root of the project, modify the config.json file.

const handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {

  if (usedPrefix == 'a' || usedPrefix == 'A') return;
  try {
    const datas = global
    const idioma = datas.db.data.users[m.sender].language || global.defaultLenguaje
    const _translate = JSON.parse(fs.readFileSync(`./src/languages/${idioma}.json`))
    const tradutor = _translate.plugins.menu_menu
    // const pp = imagen7;

    // let vn = './src/assets/audio/01J673Y3TGCFF1D548242AX68Q.mp3'
    const img = './src/assets/images/menu/languages/es/menu.png';
    const d = new Date(new Date + 3600000);
    const locale = 'es-ES';
    const week = d.toLocaleDateString(locale, { weekday: 'long' });
    const date = d.toLocaleDateString(locale, { day: '2-digit', month: '2-digit', year: 'numeric' });
    const _uptime = process.uptime() * 1000;
    const uptime = clockString(_uptime);
    const user = global.db.data.users[m.sender];
    const { money, joincount } = global.db.data.users[m.sender];
    const { exp, limit, level, role } = global.db.data.users[m.sender];
    const rtotalreg = Object.values(global.db.data.users).filter((user) => user.registered == true).length;
    const rtotal = Object.entries(global.db.data.users).length || '0'
    const more = String.fromCharCode(8206);
    const readMore = more.repeat(850);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const doc = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
    const document = doc[Math.floor(Math.random() * doc.length)];
    const str = `╔═══════════════╗
┇➤ 𝙃𝙊𝙇𝘼, 𝙃𝙐𝙈𝘼𝙉𝙊 
┇ ${taguser}
╚═══════════════╝
╔═══════════════╗
┇ 𝘽𝙊𝙇𝙄𝙇𝙇𝙊 𝘽𝙊𝙏 / 𝙈𝙀𝙇𝘿𝙀𝙓𝙕𝙕 / 𝙅𝙊𝙎𝙎 🥖
╚═══════════════╝


▸▸ 𝙂𝙀𝙉𝙀𝙍𝘼𝙇◂◂
│┊➺ 🌐.𝘧𝘳𝘦𝘦𝘧𝘪𝘳𝘦
│┊➺ 🌐.𝘭𝘢𝘣𝘪𝘣𝘭𝘪𝘢
│┊➺ 🌐.𝘨𝘶𝘪𝘢
│┊➺ 🌐.𝘭𝘢𝘯𝘨
│┊➺ 🌐.𝘭𝘢𝘯𝘨𝘨𝘳𝘰𝘶𝘱
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
▸▸𝙄𝙉𝙁𝙊◂◂
│┊➺ 👨🏻‍💻 .𝘦𝘴𝘵𝘢𝘥𝘰
│┊➺ 👨🏻‍💻 .𝘴𝘱𝘦𝘦𝘥𝘵𝘦𝘴𝘵
│┊➺ 👨🏻‍💻 .𝘥𝘰𝘯𝘢𝘳
│┊➺ 👨🏻‍💻 .𝘰𝘸𝘯𝘦𝘳
│┊➺ 👨🏻‍💻 .𝘳𝘦𝘱𝘰𝘳𝘵𝘦 𝙩𝙭𝙩
│┊➺ 👨🏻‍💻 .𝘫𝘰𝘪𝘯 𝙬𝙖𝙜𝙥_𝙪𝙧𝙡
│┊➺ 👨🏻‍💻 .𝘧𝘪𝘹𝘮𝘴𝘨𝘦𝘴𝘱𝘦𝘳𝘢
│┊➺ 👨🏻‍💻 𝘣𝘰𝘵 (𝙨𝙞𝙣 𝙥𝙧𝙚𝙛𝙞𝙟𝙤)
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
▸▸𝙅𝙐𝙀𝙂𝙊𝙎◂◂
│┊➺🕹️ .𝘮𝘢𝘵𝘦𝘴 𝙣𝙤𝙤𝙗 / 𝙚𝙖𝙨𝙮 / 𝙢𝙚𝙙𝙞𝙪𝙢 / 𝙝𝙖𝙧𝙙 / 𝙚𝙭𝙩𝙧𝙚𝙢𝙚/ 𝙞𝙢𝙥𝙤𝙨𝙨𝙞𝙗𝙡𝙚 / 𝙞𝙢𝙥𝙤𝙨𝙨𝙞𝙗𝙡𝙚2
│┊➺ 🕹️.𝘧𝘢𝘬𝘦 𝙩𝙭𝙩1 @𝙩𝙖𝙜 𝙩𝙭𝙩2
│┊➺ 🕹️.𝘱𝘱𝘵 𝙥𝙖𝙥𝙚𝙡 / 𝙩𝙞𝙟𝙚𝙧𝙖 / 𝙥𝙞𝙚𝙙𝙧𝙖
│┊➺ 🕹️ .𝘱𝘳𝘰𝘴𝘵𝘪𝘵𝘶𝘵𝘰 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘳𝘰𝘴𝘵𝘪𝘵𝘶𝘵𝘢 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘨𝘢𝘺2 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘭𝘦𝘴𝘣𝘪𝘢𝘯𝘢 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘢𝘫𝘦𝘳𝘰 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘢𝘫𝘦𝘳𝘢 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘶𝘵𝘰 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘶𝘵𝘢 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘮𝘢𝘯𝘤𝘰 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘮𝘢𝘯𝘤𝘢 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘭𝘰𝘷𝘦 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘥𝘰𝘹𝘦𝘢𝘳 𝙣𝙤𝙢𝙗𝙧𝙚 / @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘱𝘳𝘦𝘨𝘶𝘯𝘵𝘢 𝙩𝙭𝙩
│┊➺ 🕹️ .𝘴𝘶𝘪𝘵𝘱𝘷𝘱 @𝙩𝙖𝙜
│┊➺ 🕹️ .𝘴𝘭𝘰𝘵 𝘢𝘱𝘶𝘦𝘴𝘵𝘢
│┊➺ 🕹️ .𝘵𝘵𝘵 𝘯𝘰𝘮𝘣𝘳𝘦 𝘴𝘢𝘭𝘢
│┊➺ 🕹️ .𝘥𝘦𝘭𝘵𝘵𝘵
│┊➺ 🕹️ .𝘢𝘤𝘦𝘳𝘵𝘪𝘫𝘰
│┊➺ 🕹️ .𝘴𝘪𝘮𝘪 𝘵𝘹𝘵
│┊➺ 🕹️ .𝘵𝘰𝘱 𝘵𝘹𝘵
│┊➺ 🕹️ .𝘵𝘰𝘱𝘨𝘢𝘺𝘴
│┊➺ 🕹️ .𝘵𝘰𝘱𝘰𝘵𝘢𝘬𝘶𝘴
│┊➺ 🕹️ .𝘧𝘰𝘳𝘮𝘢𝘳𝘱𝘢𝘳𝘦𝘫𝘢
│┊➺ 🕹️ .𝘷𝘦𝘳𝘥𝘢𝘥
│┊➺ 🕹️ .𝘳𝘦𝘵𝘰
│┊➺ 🕹️ .𝘤𝘢𝘯𝘤𝘪𝘰𝘯
│┊➺ 🕹️ .𝘱𝘪𝘴𝘵𝘢
│┊➺ 🕹️ .𝘸𝘰𝘳𝘥𝘧𝘪𝘯𝘥
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙂𝙍𝙐𝙋𝙊 ~ 𝘼𝘿𝙈𝙄𝙉𝙎 ★
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘸𝘦𝘭𝘤𝘰𝘮𝘦
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘸𝘦𝘭𝘤𝘰𝘮𝘦
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘮𝘰𝘥𝘰𝘩𝘰𝘳𝘯𝘺
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘮𝘰𝘥𝘰𝘩𝘰𝘳𝘯𝘺
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘭𝘪𝘯𝘬
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘭𝘪𝘯𝘬
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘭𝘪𝘯𝘬2
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘭𝘪𝘯𝘬2
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘥𝘦𝘵𝘦𝘤𝘵
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘥𝘦𝘵𝘦𝘤𝘵
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘶𝘥𝘪𝘰𝘴
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘶𝘥𝘪𝘰𝘴
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘶𝘵𝘰𝘴𝘵𝘪𝘤𝘬𝘦𝘳
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘶𝘵𝘰𝘴𝘵𝘪𝘤𝘬𝘦𝘳
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘷𝘪𝘦𝘸𝘰𝘯𝘤𝘦
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘷𝘪𝘦𝘸𝘰𝘯𝘤𝘦
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘵𝘰𝘹𝘪𝘤
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘵𝘰𝘹𝘪𝘤
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘵𝘳𝘢𝘣𝘢
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘵𝘳𝘢𝘣𝘢
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘢𝘳𝘢𝘣𝘦𝘴
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘢𝘳𝘢𝘣𝘦𝘴
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘮𝘰𝘥𝘰𝘢𝘥𝘮𝘪𝘯
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘮𝘰𝘥𝘰𝘢𝘥𝘮𝘪𝘯
│┊➺🧑🏻‍⚖️ .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘥𝘦𝘭𝘦𝘵𝘦
│┊➺🧑🏻‍⚖️ .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘥𝘦𝘭𝘦𝘵𝘦
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝘿𝙀𝙎𝘾𝘼𝙍𝙂𝘼𝙎 ★
│┊➺ 📂 .𝘱𝘭𝘢𝘺 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺2 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺.1 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺.2 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺𝘥𝘰𝘤 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺𝘥𝘰𝘤2 𝙩𝙭𝙩
│┊➺ 📂 .𝘱𝘭𝘢𝘺𝘭𝘪𝘴𝘵 𝙩𝙭𝙩
│┊➺ 📂 .𝘺𝘵𝘴𝘩𝘰𝘳𝘵 𝙪𝙧𝙡
│┊➺ 📂 .𝘺𝘵𝘮𝘱3 𝙪𝙧𝙡
│┊➺ 📂 .𝘺𝘵𝘮𝘱3𝘥𝘰𝘤 𝙪𝙧𝙡
│┊➺ 📂 .𝘺𝘵𝘮𝘱4 𝙪𝙧𝙡
│┊➺ 📂 .𝘺𝘵𝘮𝘱4𝘥𝘰𝘤 𝙪𝙧𝙡
│┊➺ 📂 .𝘷𝘪𝘥𝘦𝘰𝘥𝘰𝘤 𝙪𝙧𝙡
│┊➺ 📂 .𝘴𝘱𝘰𝘵𝘪𝘧𝘺 𝙩𝙭𝙩
│┊➺ 📂 .𝘧𝘢𝘤𝘦𝘣𝘰𝘰𝘬 𝙪𝙧𝙡
│┊➺ 📂 .𝘪𝘯𝘴𝘵𝘢𝘨𝘳𝘢𝘮 𝙪𝙧𝙡
│┊➺ 📂 .𝘪𝘨𝘴𝘵𝘰𝘳𝘺 𝙪𝙨𝙧
│┊➺ 📂 .𝘵𝘪𝘬𝘵𝘰𝘬 𝙪𝙧𝙡
│┊➺ 📂 .𝘵𝘪𝘬𝘵𝘰𝘬𝘪𝘮𝘨 𝙪𝙧𝙡
│┊➺ 📂 .𝘱𝘱𝘵𝘪𝘬𝘵𝘰𝘬 𝙪𝙨𝙧
│┊➺ 📂 .𝘮𝘦𝘥𝘪𝘢𝘧𝘪𝘳𝘦 𝙪𝙧𝙡
│┊➺ 📂 .𝘱𝘪𝘯𝘵𝘦𝘳𝘦𝘴𝘵 𝙩𝙭𝙩
│┊➺ 📂 .𝘨𝘪𝘵𝘤𝘭𝘰𝘯𝘦 𝙪𝙧𝙡
│┊➺ 📂 .𝘨𝘥𝘳𝘪𝘷𝘦 𝙪𝙧𝙡
│┊➺ 📂 .𝘵𝘸𝘪𝘵𝘵𝘦𝘳 𝙪𝙧𝙡
│┊➺ 📂 .𝘳𝘪𝘯𝘨𝘵𝘰𝘯𝘦 𝙩𝙭𝙩
│┊➺ 📂 .𝘴𝘰𝘶𝘯𝘥𝘤𝘭𝘰𝘶𝘥 𝙩𝙭𝙩
│┊➺ 📂 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘱𝘢𝘤𝘬 𝙪𝙧𝙡
│┊➺ 📂 .𝘸𝘢𝘭𝘭𝘱𝘢𝘱𝘦𝘳 𝙩𝙭𝙩
│┊➺ 📂 .𝘥𝘢𝘱𝘬2 𝙪𝙧𝙡
│┊➺ 📂 .𝘹𝘯𝘹𝘹𝘥𝘭 𝙪𝙧𝙡
│┊➺ 📂 .𝘹𝘷𝘪𝘥𝘦𝘰𝘴𝘥𝘭 𝙪𝙧𝙡
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝘽𝙐𝙎𝘾𝘼𝘿𝙊𝙍 ★
│┊➺🕵🏻‍♂️ .𝘱𝘦𝘭𝘪𝘴𝘱𝘭𝘶𝘴 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘮𝘰𝘥𝘢𝘱𝘬 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘴𝘦𝘢𝘳𝘤𝘩 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘴𝘦𝘢𝘳𝘤𝘩2 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘹𝘯𝘹𝘹𝘴𝘦𝘢𝘳𝘤𝘩 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘢𝘯𝘪𝘮𝘦𝘪𝘯𝘧𝘰 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘨𝘰𝘰𝘨𝘭𝘦 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘭𝘦𝘵𝘳𝘢 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘯𝘱𝘮𝘫𝘴 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘺𝘵𝘴𝘦𝘢𝘳𝘤𝘩 𝙩𝙭𝙩
│┊➺🕵🏻‍♂️ .𝘱𝘭𝘢𝘺𝘴𝘵𝘰𝘳𝘦 𝙩𝙭𝙩
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙂𝙍𝙐𝙋𝙊 ~ 𝙏𝙊𝘿𝙊𝙎 ★
│┊➺ 🌋 .𝘢𝘥𝘥 𝘯𝘶𝘮
│┊➺ 🌋 .𝘬𝘪𝘤𝘬 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘬𝘪𝘤𝘬2 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘭𝘪𝘴𝘵𝘢𝘯𝘶𝘮 𝙩𝙭𝙩
│┊➺ 🌋 .𝘬𝘪𝘤𝘬𝘯𝘶𝘮 𝙩𝙭𝙩
│┊➺ 🌋 .𝘨𝘳𝘶𝘱𝘰 𝙖𝙗𝙧𝙞𝙧 / 𝙘𝙚𝙧𝙧𝙖𝙧
│┊➺ 🌋 .𝘨𝘳𝘰𝘶𝘱𝘵𝘪𝘮𝘦
│┊➺ 🌋 .𝘱𝘳𝘰𝘮𝘰𝘵𝘦 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘥𝘦𝘮𝘰𝘵𝘦 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘪𝘯𝘧𝘰𝘨𝘳𝘰𝘶𝘱
│┊➺ 🌋 .𝘳𝘦𝘴𝘦𝘵𝘭𝘪𝘯𝘬
│┊➺ 🌋 .𝘭𝘪𝘯𝘬
│┊➺ 🌋 .𝘴𝘦𝘵𝘯𝘢𝘮𝘦 𝙩𝙭𝙩
│┊➺ 🌋 .𝘴𝘦𝘵𝘥𝘦𝘴𝘤 𝙩𝙭𝙩
│┊➺ 🌋 .𝘪𝘯𝘷𝘰𝘤𝘢𝘳 𝙩𝙭𝙩
│┊➺ 🌋 .𝘴𝘦𝘵𝘸𝘦𝘭𝘤𝘰𝘮𝘦 𝙩𝙭𝙩
│┊➺ 🌋 .𝘴𝘦𝘵𝘣𝘺𝘦 𝙩𝙭𝙩
│┊➺ 🌋 .𝘩𝘪𝘥𝘦𝘵𝘢𝘨 𝙩𝙭𝙩
│┊➺ 🌋 .𝘩𝘪𝘥𝘦𝘵𝘢𝘨 𝙖𝙪𝙙𝙞𝙤
│┊➺ 🌋 .𝘩𝘪𝘥𝘦𝘵𝘢𝘨 𝙫𝙞𝙙𝙚𝙤
│┊➺ 🌋 .𝘩𝘪𝘥𝘦𝘵𝘢𝘨 𝙞𝙢𝙜
│┊➺ 🌋 .𝘸𝘢𝘳𝘯 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘶𝘯𝘸𝘢𝘳𝘯 @𝙩𝙖𝙜
│┊➺ 🌋 .𝘭𝘪𝘴𝘵𝘸𝘢𝘳𝘯
│┊➺ 🌋 .𝘧𝘢𝘯𝘵𝘢𝘴𝘮𝘢𝘴
│┊➺ 🌋 .𝘥𝘦𝘴𝘵𝘳𝘢𝘣𝘢
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
 ★ 𝘾𝙊𝙉𝙑𝙀𝙍𝙏𝙄𝘿𝙊𝙍 ★
│┊➺ 🏊🏻 .𝘵𝘰𝘢𝘯𝘪𝘮𝘦 𝙞𝙢𝙜
│┊➺ 🏊🏻 .𝘵𝘰𝘨𝘪𝘧𝘢𝘶𝘥 𝙫𝙞𝙙𝙚𝙤
│┊➺ 🏊🏻 .𝘵𝘰𝘪𝘮𝘨 𝙨𝙩𝙞𝙘𝙠𝙚𝙧
│┊➺ 🏊🏻 .𝘵𝘰𝘮𝘱3 𝙫𝙞𝙙𝙚𝙤
│┊➺ 🏊🏻 .𝘵𝘰𝘮𝘱3 𝙣𝙤𝙩𝙖 𝙙𝙚 𝙫𝙤𝙯
│┊➺ 🏊🏻 .𝘵𝘰𝘱𝘵𝘵 𝙫𝙞𝙙𝙚𝙤/𝙖𝙪𝙙𝙞𝙤
│┊➺ 🏊🏻 .𝘵𝘰𝘷𝘪𝘥𝘦𝘰 𝙨𝙩𝙞𝙘𝙠𝙚𝙧
│┊➺ 🏊🏻 .𝘵𝘰𝘶𝘳𝘭 𝙫𝙞𝙙𝙚𝙤/𝙞𝙢𝙜/𝙖𝙪𝙙𝙞𝙤
│┊➺ 🏊🏻 .𝘵𝘵𝘴 𝘪𝘥𝘪𝘰𝘮𝘢 𝙩𝙭𝙩
│┊➺ 🏊🏻 .𝘵𝘵𝘴 𝘦𝘧𝘦𝘤𝘵𝘰 𝙩𝙭𝙩
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙀𝙁𝙀𝘾𝙏𝙊𝙎 𝙔 𝙇𝙊𝙂𝙊𝙎 ★
│┊➺ 🖌️ .𝘭𝘰𝘨𝘰𝘴 𝘦𝘧𝘦𝘤𝘵𝘰 𝙩𝙭𝙩
│┊➺ 🖌️ .𝘭𝘰𝘨𝘰𝘤𝘩𝘳𝘪𝘴𝘵𝘮𝘢𝘴 𝙩𝙭𝙩
│┊➺ 🖌️ .𝘭𝘰𝘨𝘰𝘤𝘰𝘳𝘢𝘻𝘰𝘯 𝙩𝙭𝙩
│┊➺ 🖌️ .𝘺𝘵𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝙩𝙭𝙩
│┊➺ 🖌️ .𝘩𝘰𝘳𝘯𝘺𝘤𝘢𝘳𝘥 @𝙩𝙖𝙜
│┊➺ 🖌️ .𝘴𝘪𝘮𝘱𝘤𝘢𝘳𝘥 @𝙩𝙖𝙜
│┊➺ 🖌️ .𝘭𝘰𝘭𝘪𝘤𝘦 @𝙩𝙖𝙜
│┊➺ 🖌️ .𝘪𝘵𝘴𝘴𝘰𝘴𝘵𝘶𝘱𝘪𝘥
│┊➺ 🖌️ .𝘱𝘪𝘹𝘦𝘭𝘢𝘳
│┊➺ 🖌️ .𝘣𝘭𝘶𝘳
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙁𝙍𝘼𝙎𝙀 𝙔 𝙋𝙄𝙍𝙊𝙋𝙊𝙎 ★
│┊➺ 👩🏻‍❤️‍👨🏻 .𝘱𝘪𝘳𝘰𝘱𝘰
│┊➺ 👩🏻‍❤️‍👨🏻 .𝘤𝘰𝘯𝘴𝘦𝘫𝘰
│┊➺ 👩🏻‍❤️‍👨🏻 .𝘧𝘳𝘢𝘴𝘦𝘳𝘰𝘮𝘢𝘯𝘵𝘪𝘤𝘢
│┊➺ 👩🏻‍❤️‍👨🏻 .𝘩𝘪𝘴𝘵𝘰𝘳𝘪𝘢𝘳𝘰𝘮𝘢𝘯𝘵𝘪𝘤𝘢
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙒𝘼𝙇𝙇𝙋𝘼𝙋𝙀𝙍𝙎 & 𝙄𝙈𝘼𝙂𝙀𝙉𝙀𝙎 ★
│┊➺ 🎨 .𝘬𝘱𝘰𝘱 𝙗𝙡𝙖𝙘𝙠𝙥𝙞𝙣𝙠 / 𝙚𝙭𝙤
│┊➺ 🎨 .𝘤𝘳𝘪𝘴𝘵𝘪𝘢𝘯𝘰𝘳𝘰𝘯𝘢𝘭𝘥𝘰
│┊➺ 🎨 .𝘮𝘦𝘴𝘴𝘪
│┊➺ 🎨 .𝘤𝘢𝘵
│┊➺ 🎨 .𝘥𝘰𝘨
│┊➺ 🎨 .𝘮𝘦𝘮𝘦
│┊➺ 🎨 .𝘪𝘵𝘻𝘺
│┊➺ 🎨 .𝘣𝘭𝘢𝘤𝘬𝘱𝘪𝘯𝘬
│┊➺ 🎨 .𝘯𝘢𝘷𝘪𝘥𝘢𝘥
│┊➺ 🎨 .𝘸𝘱𝘮𝘰𝘯𝘵𝘢ñ𝘢
│┊➺ 🎨 .𝘱𝘶𝘣𝘨
│┊➺ 🎨 .𝘸𝘱𝘨𝘢𝘮𝘪𝘯𝘨
│┊➺ 🎨 .𝘸𝘱𝘢𝘦𝘴𝘵𝘩𝘦𝘵𝘪𝘤
│┊➺ 🎨 .𝘸𝘱𝘢𝘦𝘴𝘵𝘩𝘦𝘵𝘪𝘤2
│┊➺ 🎨 .𝘸𝘱𝘳𝘢𝘯𝘥𝘰𝘮
│┊➺ 🎨 .𝘸𝘢𝘭𝘭𝘩𝘱
│┊➺ 🎨 .𝘸𝘱𝘷𝘦𝘩𝘪𝘤𝘶𝘭𝘰
│┊➺ 🎨 .𝘸𝘱𝘮𝘰𝘵𝘰
│┊➺ 🎨 .𝘤𝘰𝘧𝘧𝘦𝘦
│┊➺ 🎨 .𝘱𝘦𝘯𝘵𝘰𝘭
│┊➺ 🎨 .𝘤𝘢𝘳𝘪𝘤𝘢𝘵𝘶𝘳𝘢
│┊➺ 🎨 .𝘤𝘪𝘣𝘦𝘳𝘦𝘴𝘱𝘢𝘤𝘪𝘰
│┊➺ 🎨 .𝘵𝘦𝘤𝘩𝘯𝘰𝘭𝘰𝘨𝘺
│┊➺ 🎨 .𝘥𝘰𝘳𝘢𝘦𝘮𝘰𝘯
│┊➺ 🎨 .𝘩𝘢𝘤𝘬𝘦𝘳
│┊➺ 🎨 .𝘱𝘭𝘢𝘯𝘦𝘵𝘢
│┊➺ 🎨 .𝘳𝘢𝘯𝘥𝘰𝘮𝘱𝘳𝘰𝘧𝘪𝘭𝘦
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎★ 𝙀𝘿𝙄𝙏𝘼𝙍 𝙀𝙁𝙀𝘾𝙏𝙊𝙎 𝘿𝙀 𝘼𝙐𝘿𝙄𝙊 ★
│┊➺ 🎧 .𝘣𝘢𝘴𝘴
│┊➺ 🎧 .𝘣𝘭𝘰𝘸𝘯
│┊➺ 🎧 .𝘥𝘦𝘦𝘱
│┊➺ 🎧 .𝘦𝘢𝘳𝘳𝘢𝘱𝘦
│┊➺ 🎧 .𝘧𝘢𝘴𝘵
│┊➺ 🎧 .𝘧𝘢𝘵
│┊➺ 🎧 .𝘯𝘪𝘨𝘩𝘵𝘤𝘰𝘳𝘦
│┊➺ 🎧 .𝘳𝘦𝘷𝘦𝘳𝘴𝘦
│┊➺ 🎧 .𝘳𝘰𝘣𝘰𝘵
│┊➺ 🎧 .𝘴𝘭𝘰𝘸
│┊➺ 🎧 .𝘴𝘮𝘰𝘰𝘵𝘩
│┊➺ 🎧 .𝘵𝘶𝘱𝘢𝘪
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙃𝙀𝙍𝙍𝘼𝙈𝙄𝙀𝙉𝙏𝘼𝙎 ★
│┊➺ ⚙️ .𝘪𝘯𝘴𝘱𝘦𝘤𝘵 𝘸𝘢𝘨𝘤_𝘶𝘳𝘭
│┊➺ ⚙️ .𝘤𝘩𝘢𝘵𝘨𝘱𝘵 𝙩𝙭𝙩 
│┊➺ ⚙️ .𝘥𝘦𝘭𝘤𝘩𝘢𝘵𝘨𝘱𝘵
│┊➺ ⚙️ .𝘨𝘱𝘵𝘷𝘰𝘻 𝙩𝙭𝙩
│┊➺ ⚙️ .𝘥𝘢𝘭𝘭-𝘦 𝙩𝙭𝙩
│┊➺ ⚙️ .𝘴𝘱𝘢𝘮𝘸𝘢 𝙩𝙭𝙩/𝙣𝙪𝙢/𝙘𝙖𝙣𝙩
│┊➺ ⚙️ .𝘵𝘢𝘮𝘢ñ𝘰 𝘤𝘢𝘯𝘵 𝙞𝙢𝙜 / 𝙫𝙞𝙙𝙚𝙤
│┊➺ ⚙️ .𝘳𝘦𝘢𝘥𝘷𝘪𝘦𝘸𝘰𝘯𝘤𝘦 𝙞𝙢𝙜 / 𝙫𝙞𝙙𝙚𝙤
│┊➺ ⚙️ .𝘤𝘭𝘪𝘮𝘢 𝙥𝙖𝙞𝙨 / 𝙘𝙞𝙪𝙙𝙖𝙙
│┊➺ ⚙️ .𝘦𝘯𝘤𝘶𝘦𝘴𝘵𝘢 𝙩𝙭𝙩1/𝙩𝙭𝙩2
│┊➺ ⚙️ .𝘢𝘧𝘬 𝙢𝙤𝙩𝙞𝙫𝙤
│┊➺ ⚙️ .𝘰𝘤𝘳 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚 𝙖 𝙞𝙢𝙜
│┊➺ ⚙️ .𝘩𝘥 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚 𝙖 𝙞𝙢𝙜
│┊➺ ⚙️ .𝘢𝘤𝘰𝘳𝘵𝘢𝘳 𝙪𝙧𝙡
│┊➺ ⚙️ .𝘤𝘢𝘭𝘤 𝙤𝙥𝙚𝙧𝙖𝙘𝙞𝙤𝙣
│┊➺ ⚙️ .𝘥𝘦𝘭 𝙢𝙨𝙟
│┊➺ ⚙️ .𝘸𝘩𝘢𝘵𝘮𝘶𝘴𝘪𝘤 𝙖𝙪𝙙𝙞𝙤
│┊➺ ⚙️ .𝘳𝘦𝘢𝘥𝘲𝘳 𝙞𝙢𝙜
│┊➺ ⚙️ .𝘲𝘳𝘤𝘰𝘥𝘦 𝙩𝙭𝙩
│┊➺ ⚙️ .𝘳𝘦𝘢𝘥𝘮𝘰𝘳𝘦 𝙩𝙭𝙩1/𝙩𝙭𝙩2
│┊➺ ⚙️ .𝘴𝘵𝘺𝘭𝘦𝘵𝘦𝘹𝘵 𝙩𝙭𝙩
│┊➺ ⚙️ .𝘵𝘳𝘢𝘥𝘶𝘤𝘪𝘳 𝙩𝙭𝙩
│┊➺ ⚙️ .𝘯𝘰𝘸𝘢 𝙣𝙪𝙢
│┊➺ ⚙️ .𝘩𝘰𝘳𝘢𝘳𝘪𝘰
│┊➺ ⚙️ .𝘥𝘳𝘰𝘱𝘮𝘢𝘪𝘭
│┊➺ ⚙️ .𝘪𝘨𝘴𝘵𝘢𝘭𝘬 𝙪𝙨𝙧
│┊➺ ⚙️ .𝘵𝘪𝘬𝘵𝘰𝘬𝘴𝘵𝘢𝘭𝘬 𝙪𝙨𝙧
│┊➺ ⚙️ .𝘪𝘮𝘨 𝙩𝙭𝙩
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙀𝙉𝙏𝙍𝙀𝙏𝙀𝙉𝙄𝙈𝙄𝙀𝙉𝙏𝙊 ★
│┊➺ 🍿 .𝘤𝘢𝘻𝘢𝘳
│┊➺ 🍿 .𝘤𝘰𝘧𝘳𝘦
│┊➺ 🍿 .𝘣𝘢𝘭𝘢𝘯𝘤𝘦
│┊➺ 🍿 .𝘤𝘭𝘢𝘪𝘮
│┊➺ 🍿 .𝘩𝘦𝘢𝘭
│┊➺ 🍿 .𝘭𝘣
│┊➺ 🍿 .𝘭𝘦𝘷𝘦𝘭𝘶𝘱
│┊➺ 🍿 .𝘮𝘺𝘯𝘴
│┊➺ 🍿 .𝘱𝘦𝘳𝘧𝘪𝘭
│┊➺ 🍿 .𝘸𝘰𝘳𝘬
│┊➺ 🍿 .𝘮𝘪𝘯𝘢𝘳
│┊➺ 🍿 .𝘣𝘶𝘺
│┊➺ 🍿 .𝘣𝘶𝘺𝘢𝘭𝘭
│┊➺ 🍿 .𝘷𝘦𝘳𝘪𝘧𝘪𝘤𝘢𝘳
│┊➺ 🍿 .𝘳𝘰𝘣𝘢𝘳 𝘤𝘢𝘯𝘵 @𝙩𝙖𝙜
│┊➺ 🍿 .𝘤𝘳𝘪𝘮𝘦
│┊➺ 🍿 .𝘵𝘳𝘢𝘯𝘴𝘧𝘦𝘳 𝘵𝘪𝘱𝘰 𝘤𝘢𝘯𝘵 @𝙩𝙖𝙜
│┊➺ 🍿 .𝘶𝘯𝘳𝘦𝘨 𝘴𝘯
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝙎𝙏𝙄𝘾𝙆𝙀𝙍𝙎 𝙔 𝙀𝙁𝙀𝘾𝙏𝙊𝙎 ★
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚𝙧 𝙖 𝙪𝙣𝙖 𝙞𝙢𝙜 𝙤 𝙫𝙞𝙙𝙚𝙤
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳 𝙪𝙧𝙡
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳2 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚𝙧 𝙖 𝙪𝙣𝙖 𝙞𝙢𝙜 𝙤 𝙫𝙞𝙙𝙚𝙤
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳2 𝙪𝙧𝙡
│┊➺ 🎭 .𝘴 𝙧𝙚𝙨𝙥𝙤𝙣𝙙𝙚𝙧 𝙖 𝙪𝙣𝙖 𝙞𝙢𝙜 𝙤 𝙫𝙞𝙙𝙚𝙤                                  
│┊➺ 🎭 .𝘴 𝙪𝙧𝙡
│┊➺ 🎭 .𝘦𝘮𝘰𝘫𝘪𝘮𝘪𝘹 𝙚𝙢𝙤𝙟𝙞1&𝙚𝙢𝙤𝙟𝙞2
│┊➺ 🎭 .𝘴𝘤𝘪𝘳𝘤𝘭𝘦 𝙞𝙢𝙜
│┊➺ 🎭 .𝘴𝘳𝘦𝘮𝘰𝘷𝘦𝘣𝘨 𝙞𝙢𝙜
│┊➺ 🎭 .𝘴𝘦𝘮𝘰𝘫𝘪 𝙩𝙞𝙥𝙤 𝙚𝙢𝙤𝙟𝙞
│┊➺ 🎭 .𝘲𝘤 𝙩𝙭𝙩
│┊➺ 🎭 .𝘱𝘢𝘵 @𝙩𝙖𝙜
│┊➺ 🎭 .𝘴𝘭𝘢𝘱 @𝙩𝙖𝙜
│┊➺ 🎭 .𝘬𝘪𝘴𝘴 @𝙩𝙖𝙜
│┊➺ 🎭 .𝘥𝘢𝘥𝘰
│┊➺ 🎭 .𝘸𝘮 𝙥𝙖𝙘𝙠𝙣𝙖𝙢𝙚 𝙖𝙪𝙩𝙤𝙧
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘮𝘢𝘳𝘬𝘦𝘳 𝙚𝙛𝙚𝙘𝙩𝙤 𝙞𝙢𝙜
│┊➺ 🎭 .𝘴𝘵𝘪𝘤𝘬𝘦𝘳𝘧𝘪𝘭𝘵𝘦𝘳 𝙚𝙛𝙚𝙘𝙩𝙤 𝙞𝙢𝙜
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙
★ 𝘼𝘿𝙈𝙄𝙉𝙄𝙎𝙏𝙍𝘼𝘾𝙄Ó𝙉 𝙔 𝘾𝙊𝙉𝙁𝙄 ★
│┊➺ 👑 .𝘥𝘴𝘰𝘸𝘯𝘦𝘳
│┊➺ 👑 .𝘴𝘦𝘵𝘱𝘳𝘦𝘧𝘪𝘹 𝙥𝙧𝙚𝙛𝙞𝙟𝙤
│┊➺ 👑 .𝘳𝘦𝘴𝘦𝘵𝘱𝘳𝘦𝘧𝘪𝘹
│┊➺ 👑 .𝘢𝘶𝘵𝘰𝘢𝘥𝘮𝘪𝘯
│┊➺ 👑 .𝘨𝘳𝘰𝘶𝘱𝘭𝘪𝘴𝘵
│┊➺ 👑 .𝘤𝘩𝘦𝘵𝘢𝘳
│┊➺ 👑 .𝘭𝘦𝘢𝘷𝘦𝘨𝘤
│┊➺ 👑 .𝘤𝘢𝘫𝘢𝘧𝘶𝘦𝘳𝘵𝘦
│┊➺ 👑 .𝘣𝘭𝘰𝘤𝘬𝘭𝘪𝘴𝘵
│┊➺ 👑 .𝘢𝘥𝘥𝘰𝘸𝘯𝘦𝘳 @𝙩𝙖𝙜 / 𝙣𝙪𝙢
│┊➺ 👑 .𝘥𝘦𝘭𝘰𝘸𝘯𝘦𝘳 @𝙩𝙖𝙜 / 𝙣𝙪𝙢
│┊➺ 👑 .𝘣𝘭𝘰𝘤𝘬 @𝙩𝙖𝙜 / 𝙣𝙪𝙢
│┊➺ 👑 .𝘶𝘯𝘣𝘭𝘰𝘤𝘬 @𝙩𝙖𝙜 / 𝙣𝙪𝙢
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘳𝘦𝘴𝘵𝘳𝘪𝘤𝘵
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘳𝘦𝘴𝘵𝘳𝘪𝘤𝘵
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘶𝘵𝘰𝘳𝘦𝘢𝘥
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘶𝘵𝘰𝘳𝘦𝘢𝘥
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘱𝘶𝘣𝘭𝘪𝘤
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘱𝘶𝘣𝘭𝘪𝘤
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘱𝘤𝘰𝘯𝘭𝘺
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘱𝘤𝘰𝘯𝘭𝘺
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘨𝘤𝘰𝘯𝘭𝘺
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘨𝘤𝘰𝘯𝘭𝘺
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘤𝘢𝘭𝘭
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘤𝘢𝘭𝘭
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘱𝘳𝘪𝘷𝘢𝘥𝘰
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘱𝘳𝘪𝘷𝘢𝘥𝘰
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘶𝘥𝘪𝘰𝘴_𝘣𝘰𝘵
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘶𝘥𝘪𝘰𝘴_𝘣𝘰𝘵
│┊➺ 👑 .𝘦𝘯𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘴𝘱𝘢𝘮
│┊➺ 👑 .𝘥𝘪𝘴𝘢𝘣𝘭𝘦 𝘢𝘯𝘵𝘪𝘴𝘱𝘢𝘮
│┊➺ 👑 .𝘮𝘴𝘨 𝙩𝙭𝙩
│┊➺ 👑 .𝘣𝘢𝘯𝘤𝘩𝘢𝘵
│┊➺ 👑 .𝘶𝘯𝘣𝘢𝘯𝘤𝘩𝘢𝘵
│┊➺ 👑 .𝘳𝘦𝘴𝘦𝘵𝘶𝘴𝘦𝘳 @𝙩𝙖𝙜
│┊➺ 👑 .𝘣𝘢𝘯𝘶𝘴𝘦𝘳 @𝙩𝙖𝙜
│┊➺ 👑 .𝘶𝘯𝘣𝘢𝘯𝘶𝘴𝘦𝘳 @𝙩𝙖𝙜                       
│┊➺ 👑 .𝘣𝘢𝘯𝘭𝘪𝘴𝘵
│┊➺ 👑 .𝘢𝘥𝘥𝘱𝘳𝘦𝘮 @𝙩𝙖𝙜 𝙩𝙞𝙢𝙚
│┊➺ 👑 .𝘢𝘥𝘥𝘱𝘳𝘦𝘮2 @𝙩𝙖𝙜 𝙩𝙞𝙢𝙚
│┊➺ 👑 .𝘢𝘥𝘥𝘱𝘳𝘦𝘮3 @𝙩𝙖𝙜 𝙩𝙞𝙢𝙚
│┊➺ 👑 .𝘢𝘥𝘥𝘱𝘳𝘦𝘮4 @𝙩𝙖𝙜 𝙩𝙞𝙢𝙚
│┊➺ 👑 .𝘥𝘦𝘭𝘱𝘳𝘦𝘮 @𝙩𝙖𝙜 
│┊➺ 👑 .𝘭𝘪𝘴𝘵𝘤𝘮𝘥
│┊➺ 👑 .𝘴𝘦𝘵𝘱𝘱𝘣𝘰𝘵 𝙧𝙚𝙥𝙡𝙮 𝙩𝙤 𝙞𝙢𝙜
│┊➺ 👑 .𝘢𝘥𝘥𝘤𝘮𝘥 𝙩𝙭𝙩
│┊➺ 👑 .𝘥𝘦𝘭𝘤𝘮𝘥
│┊➺ 👑 .𝘴𝘢𝘷𝘦𝘪𝘮𝘢𝘨𝘦
│┊➺ 👑 .𝘷𝘪𝘦𝘸𝘪𝘮𝘢𝘨𝘦
│┊➺ 👑 .𝘤𝘭𝘦𝘢𝘳𝘱𝘮
│┊➺ 👑 .𝘳𝘦𝘴𝘵𝘢𝘳𝘵
│┊➺ 👑 .𝘶𝘱𝘥𝘢𝘵𝘦
│┊➺ 👑 .𝘣𝘢𝘯𝘭𝘪𝘴𝘵
╰ ∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙

➤  𝘽𝙊𝙇𝙄𝙇𝙇𝙊 𝘽𝙊𝙏 / 𝙈𝙀𝙇𝘿𝙀𝙓𝙕𝙕 / 𝙅𝙊𝙎𝙎 🥖`

    let pp
    // Nuevas Imágenes del menu para otros idiomas
    if (idioma == 'es') {
      pp = global.imagen1
    } else if (idioma == 'pt-br') {
      pp = global.imagen2
    } else if (idioma == 'fr') {
      pp = global.imagen3
    }else if (idioma == 'en') {
      pp = global.imagen4
    } else if (idioma == 'ru') {
      pp = global.imagen5
    } else {
      pp = global.imagen1 // Imagen por defecto (Español/Spanish)
    }



    if (m.isGroup) {
      // await conn.sendFile(m.chat, vn, './src/assets/audio/01J673Y3TGCFF1D548242AX68Q.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net') }, { quoted: m });
    } else {
      //await conn.sendFile(m.chat, vn, './src/assets/audio/01J673Y3TGCFF1D548242AX68Q.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      const fkontak = { key: { participants:"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { " contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender .split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
      conn.sendMessage(m.chat, { image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net') }, { quoted: fkontak });
    }
  } catch {
    const datas = global
    const idioma = datas.db.data.users[m.sender].language || global.defaultLenguaje
    const _translate = JSON.parse(fs.readFileSync(`./src/languages/${idioma}.json`))
    const tradutor = _translate.plugins.menu_menu
    
    conn.reply(m.chat, translator.texto1[29], m);
  }
};
handler.command = /^(menu|help|comandos|commands|cmd|cmds)$/i;
handler.exp = 50;
handler.fail = null;
export default handler;
function clockString(ms) {
  const h = isNaN(ms) ? '--' : Math.floor(ms / 3600000);
  const m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60;
  const s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60;
  return [h, m, s].map((v) => v.toString().padStart(2, 0)).join(':');
      }

 
